{
  "overview": {
    "name": "Will Borden",
    "label": "Electronics engineer",
    "image": "",
    "email": "will.borden01@gmail.com",
    "summary": "Space avionics engineer, undergraduate student at the University of Melbourne studying electronics engineering",
    "location": {
      "city": "Melbourne",
      "countryCode": "AU",
      "region": "Victoria"
    }
  },

  "education": [
    {
      "institution": "The University of Bordeaux",
      "location": "Bordeaux, France",
      "url": "https://www.u-bordeaux.fr/",
      "area": "French Studies - Sociology",
      "studyType": "Diploma in Languages - French",
      "startDate": "2024-08-22",
      "endDate": "2024-12-03",
      "courses": ["Academic exchange through the University of Melbourne"]
    },
    {
      "institution": "The University of Melbourne",
      "location": "Melbourne, Australia",
      "url": "https://www.unimelb.edu.au/",
      "area": "Electrical Engineering Systems",
      "studyType": "Bachelor of Science",
      "startDate": "2022-02-28",
      "endDate": "2025-12-05",
      "courses": ["Weighted average mark of 87.29/100, equivalent GPA of 3.97", "2023 Dean's Honours List recipient", "Concurrent Diploma in Languages - French", "Equivalent minor in Physics"]
    }    
  ],

  "experience": [
    {
      "name": "Melbourne Space Laboratory",
      "position": "Research Assistant - Electronics Engineering",
      "url": "https://melbournespace.research.unimelb.edu.au/",
      "startDate": "2025-07-16",
      "endDate": "present",
      "summary": "Performed end-to-end design, manufacturing, and testing of the thermal control unit for an Australian Space Agency / NASA-built lunar rover, including the EM, EQM, and FM hardware. Designed and manufactured complex, EMI compliant PCBs for use with radation-hardened electronic components. Wrote register-level embedded software, using an RTOS framework. Conducted detailed failure mode analysis and simulations to ensure robustness to conditions on the lunar surface."
    },
    {
      "name": "Esper Satellite Imagery",
      "position": "Electronics Engineer",
      "url": "https://www.espersatellites.co/",
      "startDate": "2025-02-24",
      "endDate": "2025-07-15",
      "summary": "Designed, implemented, and tested space-grade circuitry for a hyperspectral earth-observation payload. Communicated with external space provider, managed interface control description documents, and conducted reviews to ensure compliance. Used Atlassian project management suite to document work and organise requirements and timelines. Conducted extensive failure mode analysis of electrical systems. Designed, manufactured, and outsourced space-grade wiring harnesses and PCBs."
    },
    {
      "name": "ARES Rocketry Team",
      "position": "Lead Systems Engineer",
      "url": "https://www.instagram.com/aresunimelb/?hl=en",
      "startDate": "2025-06-01",
      "endDate": "present",
      "summary": "Implemented industry-standard, requirements-driven systems engineering practices in a team over over 100 student engineers. Undertook extensive documentation to increase decision traceability and knowledge preservation. Managed requirements, V&V plans, timelines, design reviews, and interface control documents. Acted as a chief technical SME for the development of ARES' first student-designed hybrid engine based rocket."
    },
    {
      "name": "ARES Rocketry Team",
      "position": "Chief Engineer",
      "url": "https://www.instagram.com/aresunimelb/?hl=en",
      "startDate": "2023-07-01",
      "endDate": "2024-08-10",
      "summary": "Acted as chief technical lead of ARES, to design and construct a 30'000ft altitude sounding rocket to compete in the 2024 Spaceport America Cup. This rocket placed 4th out of 152 international universities, 2nd in its category, and remains one of the most successful rockets in Australian collegiate rocketry history. Was responsible for the oversight of all technical decisions and design reviews, as well as authoring technical documentation for project judging and knowledge preservation. "
    },
    {
      "name": "ARES Rocketry Team",
      "position": "Avionics Lead",
      "url": "https://www.instagram.com/aresunimelb/?hl=en",
      "startDate": "2023-01-01",
      "endDate": "2023-07-10",
      "summary": "Was electrical lead for ARES' entry into the 2023 SAC. Managed a team of 10 avionics engineers to design and manufacture the vehicle's avionics stack and ground support equipment. Single-handedly designed and implemented a robust, future-proofed flight computer. This project was selected to be presented as a podium session at the 2023 SAC, and remains the team's main flight computer almost 3 years later. "
    },
    {
      "name": "QinetiQ Australia",
      "position": "Technical Staff - University of Melbourne Creator Space",
      "url": "https://eng.unimelb.edu.au/the-creator-space",
      "startDate": "2023-02-10",
      "endDate": "present",
      "summary": "Supervised students and staff in a busy, state-of-the-art engineering workshop. Utilised extensive electronics experience to troubleshoot problems and educate users. Administered trainings to upskill users in the use of electronic test equipment and PCB manufacturing. Supported risk assessment for trainings and events, actioned safety initiatives, and managed competency databases."
    },
    {
      "name": "Motorcycle Cruise Controls",
      "position": "Electronics Engineer",
      "url": "https://mccruise.com/",
      "startDate": "2019-06-15",
      "endDate": "2022-04-02",
      "summary": "Designed custom test equipment to streamline safety checks and improve ergonomics. Identified issues in and repaired faulty PCBs, allowing discarded stock to be recovered and sold. Visited and inspected PCB assembly factories to identify candidates for future production runs. Used hand soldering skills to modify existing circuit boards for unique applications."
    }
  ],

  "skills": [
    {
      "name": "Electronics",
      "level": "Master",
      "icon": "fa-solid fa-microchip",
      "keywords": [
        "Use of Altium Designer to create aesthetic and readable schematics, as well as designing and manufacturing robust multi-layer PCBs (approx. 7 years of experience, also have experience in KiCAD and EagleCAD).",
        " ",
        "Use of electronics knowledge to design analogue, digital, RF, and embedded solutions that meet requirements and constraints.",
        " ",
        "SMT PCB assembly through use of reflow ovens, hand soldering of small packages.",
        " ",
        "Troubleshooting problems through use of test equipment and electronics knowledge to find faults in circuits."
      ]
    },
    {
      "name": "Firmware",
      "level": "Master",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Programming microcontrollers in C/C++ for embedded applications, both at register level and through hardware abstraction layers.",
        " ",
        "Writing drivers for ICs and sensors, working with Kalman filters, and using a range of high-speed communication protocols (approx. 4 years of experience)",
        " ",
        "FPGA programming in Verilog, using Intel’s Quartus software package."
      ]
    },
    {
      "name": "Systems Engineering",
      "level": "Master",
      "icon": "fa-solid fa-chart-gantt",
      "keywords": [
        "V-model based systems engineering frameworks, aerospace design review processes",
        " ",
        "Requirements and V&V management for large, interdisciplinary projects",
        " ",
        "Timeline and task management in Atlassian Jira",
        " ",
        "Interface control documentation"
      ]
    },
    {
      "name": "Physics",
      "level": "Master",
      "icon": "fa-solid fa-atom",
      "keywords": [
        "Undergraduate-level knowledge of classical electrodynamics, quantum physics, and optics/lasers",
        " ",
        "Profficient with application of content from Griffith's elecrodynamics and quantum textbooks"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "French",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Languages",
      "icon": "fa-solid fa-language",
      "keywords": [
        "Learning and speaking French",
        "French philosophy and litterature"
      ]
    },
    {
      "name": "Music",
      "icon": "fa-solid fa-music",
      "keywords": [
        "Learning jazz/folk guitar",
        "Building and playing electronic synthesizers",
        "Restoring vintage music equipment (reel-to-reel players, recording decks, guitar amplifiers/pedals)"
      ]
    },
    {
      "name": "Misc",
      "icon": "fa-solid fa-book",
      "keywords": [
        "Completing cryptic crosswords and general knowledge quizzes",
        "Watching YouTube videos on electronics engineering, physics, and space"
      ]
    }
  ]
}
